{
  "disclaimer": "No pude encontrar una manera de que esta aplicación se pudiera disfrutar en vertical, así que por favor gire su teléfono o aumente el ancho de su navegador.",
  "scrollframe": "<h2>D'Arcy Playground</h2><p>Por <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://github.com/Bertani545/darcy-playground\">Jesús Bertani Ramírez</a>.</p><p>Sea bienvenid@ a D'Arcy Playground. Aquí, puede subir la imagen que quiera y deformarla usando transformaciones \\(\\R^2 \\to \\R^2\\). Esta página está inspirada en el trabajo del biólogo <b>D'Arcy Wentworth Thompson</b>, quien dijo que los cambios en las plantas y animales podían ser explicados usando transformaciones continuas del plano Cartesiano. Puedes aprender más sobre él su <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://es.wikipedia.org/wiki/D%27Arcy_Wentworth_Thompson\">página de wikipedia</a>.</p><h2>¿Cómo se usa?</h2><ul><li>Cargue <b>Ejemplos prehechos</b> haciendo click en el símbolo \"!\".</li><li>Suba sus propias imágenes (.jpg, .png, .svg, etc.) usando el botón correspondiente o arrástrelas y suéltelas en la <b>cuadrícula de la izquierda</b>.</li><li> Mueva y haga zoom en la cuadrícula de la izquierda arrastrando el mouse y haciendo uso de la rueda de desplazamiento. Esto actualiza la porción del espacio que la cuadrícula cubre.</li><li> Cuando el <b>candado</b> de la cuadrícula izquierda está <b>rojo</b>, la imagen se quedará en su posición actual en el espacio.</li><li> Si presiona el candado, este cambiará a <b>verde</b> y ahora la imagen se mantendrá en el centro de la cuadrícula, y se moverá y escalará junto con el espacio.</li><li>Puede cambiar los parámetros de su imagen usando el botón <i>editar</i>.</li><li>Junto a \\(f_1\\)  y \\(f_2\\) puede introducir la expresión de una función \\(\\R^2\\to\\R\\). Juntas, definen la transformación que se muestra en la cuadrícula de la derecha. Tome en cuenta que la cuadrícula de la derecha es tal que siempre va a ser un rectángulo en el que quepa la totalidad de los puntos transformados.</li><li>Todas las funciones trigonométricas usuales están disponibles: \\(\\sin, \\cos, \\tan, \\sec, \\csc, \\cot \\) con su versión hiperbólica correspondiente. También están disponibles \\( \\asin, \\acos, \\atan \\).</li><li> Otras funciones disponibles son \\(\\ln\\), \\(\\log_{10}\\) (como log), \\(\\exp\\), \\(\\Gamma\\) (como Gamma), \\(|\\cdot|\\) (como abs) y \\(\\sqrt{\\cdot}\\) (como sqrt). </li><li>Por favor indique el inicio y el final de los parámetros con paréntesis.</li><li>Las constantes disponibles son \\(e\\) y \\(\\pi\\) (como pi)</li><li> Las variables disponibles son \\(x\\), \\(y\\) y \\(t\\)</li><li>La variable \\(t\\) hace que sus funciones dependan del tiempo. Use los controles a la derecha de la pantalla para:</li><ul> <li>Iniciar y pausar el flujo del tiempo,</li><li> Ver y modificar el valor actual de \\(t\\),</li><li> Dar click en el botón de configuración para abrir el <i>menú de ajustes del tiempo</i> y definir sus propios parámetros.</li></ul>",
  "uploadBtn": "Subir Img.",
  "editBtn": "Editar Img.",
  "title": "Transformaciones del Plano",
  "loadTitle": "Cargar Ejemplo",
  "ppc": "Puntos por Curva",
  "width": "Ancho",
  "height": "Alto",
  "posX": "Posición en X",
  "posY": "Posición en Y",
  "rotation": "Rotación en grados",
  "timeTitle": "Ajuste del Tiempo",
  "timeDuration": "Duración en segundos (pueden ser negativos)",

  "f1_placeholder": "Ingresa f1(x,y)",
  "f2_placeholder": "Ingresa f2(x,y)",

  "number_input": "Ingresa un número decimal",
  "number_input_integer": "Ingresa un número entero",

  "duration_error": "La duración no puede ser 0.",
  "minT_error": "El valor de min t debe ser menor que max t.",
  "funcError": "\\text{No es una expresión válida}",

  "tooltipExamples": "Mostrar los Ejemplos",
  "tooltipLanguages": "Cambiar el Idioma"
}
